Revit 2026 API

# ExternalResourceReferenceGetResourceShortDisplayName Method

---

Gets the short display name of the external resource.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetResourceShortDisplayName()
```
```vb
Public Function GetResourceShortDisplayName As String
```
```cpp
public:
String^ GetResourceShortDisplayName()
```
```fsharp
member GetResourceShortDisplayName : unit -> string
```

#### Return Value

String The short display name of the external resource.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The ExternalResourceReference (this ExternalResourceReference) is has no valid display path. |

For an external resource, such as a Rvt Link loaded from an external server, which has a full display path such as "My Server://Nested/Nested_1.rvt", this function returns "Nested_1.rvt". For an external resource, such as a Rvt Link loaded from the "built-in" server, which has a full display path such as "c:\LocalLinks\Link_1.rvt", this function returns "Link_1.rvt".

#### Reference

ExternalResourceReference Class

Autodesk.Revit.DB Namespace